Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.Distance
Distance from point on first curve to the point on second curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnSecondCurve
1d raw (not normalized) parameter of the point on the second curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnFirstCurve
1d raw (not normalized) parameter of the point on the first curve.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnSecondCurve
Point on the second curve in 3d coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve
Point on the first curve in 3d coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor
Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor(Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves)
Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
This class captures results of computation of closest points between two generic curves.
Since:
2018.1